# Use `brew bundle` to install the packages below

# Packages
brew 'openssl'
brew 'tree'
brew 'wget'
brew 'mas'
brew 'dos2unix'
brew 'jq'
brew 'jenv'
brew 'vim', args: ['--override-system-vi']
brew 'nvm'
brew 'fasd'
brew 'watch'
brew 'httpie'
brew 'fpp'
brew 'michaeldfallen/formula/git-radar'

# Casks
tap 'caskroom/cask'
cask_args appdir: '/Applications'

cask 'iterm2'
cask 'atom'
cask 'brackets'
cask 'github'
cask 'hyper'
cask 'virtualbox'

# Quick Look plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'betterzipql'

brew update
brew doctor

# AppStore
mas '1Password', id: 443987910
